//=============================================================================
//
// フェード処理 [fade.h]
// Author : 山田陵太
//
//=============================================================================
#ifndef _FADE_H_
#define _FADE_H_

//=============================================================================
//インクルードファイル
//=============================================================================
#include "manager.h"

class CPolygon;

//=============================================================================
//フェードクラス
//=============================================================================
class CFade
{
public:
	//=========================================================================
	//列挙型定義
	//=========================================================================
	typedef enum
	{
		FADE_MODE_NONE = 0,	//何もない状態
		FADE_MODE_IN,	//フェードイン状態
		FADE_MODE_OUT,	//フェードアウト状態
		FADE_MODE_MAX
	}FADE_MODE;

	//=========================================================================
	//メンバ関数宣言
	//=========================================================================
	CFade();
	~CFade();

	static CFade *Create(void);

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void SetFade(CManager::MODE_TYPE mode);

	FADE_MODE GetFade(void);
private:
	//=========================================================================
	//メンバ変数宣言
	//=========================================================================
	D3DXCOLOR m_colorFade;	//フェード色
	FADE_MODE m_FadeMode;	//フェードモード判定用
	CManager::MODE_TYPE m_modeNext;	//フェード終了後のモード設定用
	CPolygon *m_pPolygon;
};
#endif