//=============================================================================
//
// レンダラー処理 [renderer.h]
// Author : 山田陵太
//
//=============================================================================
#ifndef _RENDERER_H_
#define _RENDERER_H_

//=============================================================================
//インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CShader;

//=============================================================================
//レンダリングクラス
//=============================================================================
class CRenderer
{
public:
	//=========================================================================
	//メンバ関数宣言
	//=========================================================================
	CRenderer();
	~CRenderer();
	HRESULT Init(HWND hWnd, bool bWindow);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	bool SetUpViewport(int nNumber);
	LPDIRECT3DDEVICE9 GetDevice(void);
	D3DVIEWPORT9 GetViewPort(int nCount);
private:
	//=========================================================================
	//メンバ関数宣言
	//=========================================================================
	LPDIRECT3DDEVICE9 m_pD3DDevice;	// Deviceオブジェクト(描画に必要)
	LPDIRECT3D9	m_pD3D;			// Direct3Dオブジェクト
	LPDIRECT3D9 m_pD3DInterface;				// DirectXインターフェース
	D3DPRESENT_PARAMETERS *m_pD3DPresentParam;	// プレゼンテーションパラメータ
	CShader *m_pShader;							// シェーダのポインタ
	D3DVIEWPORT9 m_view_port[2];

};

#endif