//=============================================================================
//
// リザルト処理 [result.h]
// Author : 山田陵太
//
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

//=============================================================================
//インクルードファイル
//=============================================================================
#include "scene.h"

//=============================================================================
//前方宣言
//=============================================================================
class CScene2d;

//=============================================================================
//リザルトクラス
//=============================================================================
class CResult : public CScene
{
public:
	CResult(int nPriority = PRIORITY_0);
	~CResult();

	static CResult* Create(void);
	static HRESULT Load(void);
	HRESULT Init(const D3DXVECTOR3 pos, const D3DXVECTOR3 size);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	static LPDIRECT3DTEXTURE9 m_pTexture[2];
	CScene2d* m_pScene2D;
};
#endif