//=============================================================================
//
// リザルト処理 [result.cpp]
// Author : 山田陵太
//
//=============================================================================
#include "result.h"
#include "manager.h"
#include "renderer.h"
#include "input.h"
#include "scene2d.h"
#include "fade.h"
#include "keyboard.h"

//=============================================================================
//静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CResult::m_pTexture[2] = {};

//=============================================================================
//リザルトクラスのコンストラクタ
//=============================================================================
CResult::CResult(int nPriority) : CScene(nPriority)
{
	//メンバ変数のクリア
	m_pScene2D = NULL;
}

//=============================================================================
//リザルトクラスのデストラクタ
//=============================================================================
CResult::~CResult()
{
}

//=============================================================================
//リザルトクラスのクリエイト処理
//=============================================================================
CResult * CResult::Create(void)
{
	//リザルトクラスのポインタ変数
	CResult *pResult = NULL;

	//メモリの確保
	pResult = new CResult;

	//メモリが確保できていたら
	if (pResult != NULL)
	{
		//初期化処理呼び出し
		pResult->Init(D3DXVECTOR3(SCREEN_WIDTH/2,SCREEN_HEIGHT/2,0.0f),D3DXVECTOR3(SCREEN_WIDTH/2,SCREEN_HEIGHT/2,0.0f));
	}

	return pResult;
}

//=============================================================================
//リザルトクラスのテクスチャ読み込み処理
//=============================================================================
HRESULT CResult::Load(void)
{
	//デバイス情報の取得
	LPDIRECT3DDEVICE9 pDevice = CManager::GetRenderer()->GetDevice();
	
	D3DXCreateTextureFromFile(pDevice, "data/Texture/Result.png", &m_pTexture[0]);

	return S_OK;
}

//=============================================================================
//リザルトクラスの初期化処理
//=============================================================================
HRESULT CResult::Init(const D3DXVECTOR3 pos, const D3DXVECTOR3 size)
{
	//2Dオブジェクトの生成
	m_pScene2D = CScene2d::Create(pos, size);
	if (m_pScene2D != NULL)
	{
		m_pScene2D->BindTexture(m_pTexture[0]);
	}
	

	return E_NOTIMPL;
}

//=============================================================================
//リザルトクラスの終了処理
//=============================================================================
void CResult::Uninit(void)
{
	if (m_pScene2D != NULL)
	{
		m_pScene2D->Uninit();
	}

	//オブジェクトの破棄
	SetDeathFlag();
}

//=============================================================================
//リザルトクラスの更新処理
//=============================================================================
void CResult::Update(void)
{
	CInputKeyboard *pKey = CManager::GetKeyboard();
	CFade *pFade = CManager::GetFade();

	if (pKey->GetTrigger(DIK_RETURN))
	{
		if (pFade != NULL)
		{
			pFade->SetFade(CManager::MODE_TYPE_TITLE);
		}
		Uninit();
	}
}

//=============================================================================
//リザルトクラスの描画処理
//=============================================================================
void CResult::Draw(void)
{
}
